jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>License\CMSIS_END_USER_LICENSE_AGREEMENT.txt</license>  
  <vendor>Infineon</vendor>
  <url>http://media.infineon.com/mdk/</url>
  <name>XMC1000_DFP</name>
  <description>Infineon XMC1000 Series Device Support</description>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact>
  
  <releases>
    <release version="2.2.0">
      Infineon CMSIS-Core files released 30. October 2015
      Added Devices: XMC1401-Q048x0064,  XMC1401-Q048x00128, XMC1401-F064x0064, 
                     XMC1401-F064x00128, XMC1402-Q040x0032,  XMC1402-Q040x0064, 
		             XMC1402-Q040x0128,  XMC1402-Q048x0032,  XMC1402-Q048x0064, 
		             XMC1402-Q048x0128,  XMC1402-Q064x0064,  XMC1402-Q064x0128, 
		             XMC1402-Q064x0200,  XMC1402-F064x0064,  XMC1402-F064x0128, 
		             XMC1402-F064x0200,  XMC1403-Q048x0064,  XMC1403-Q048x0128, 
		             XMC1403-Q048x0200,  XMC1403-Q064x0064,  XMC1403-Q064x0128, 
		             XMC1403-Q064x0200,  XMC1404-Q048x0064,  XMC1404-Q048x0128, 
		             XMC1404-Q048x0200,  XMC1404-Q064x0064,  XMC1404-Q064x0128, 
		             XMC1404-Q064x0200,  XMC1404-F064x0064,  XMC1404-F064x0128, 
		             XMC1404-F064x0200 
       Update of XMC Lib to v2.1.2
       Updated of CMSIS files
    </release>   
    <release version="2.1.0">
      Infineon CMSIS-Core files released 24. July 2015
      Update of XMC Lib to v2.0
      Update of RTE driver
      Add new conditions for RTE driver   
      Added Devices: XMC1301-T038x0064, XMC1202-T028x0064 
      Add CMSIS driver examples (SPI, UART)
    </release>
    <release version="2.0.0">
      Infineon CMSIS-Core files released 18. February 2015
      Update of Infineon CMSIS files (header, SVD, startup)
      Add low level driver (LLD) package and example projects
    </release>
     <release version="1.6.0">
      Infineon CMSIS-Core files released 24. November 2014
      Update of documents
      Update of Infineon CMSIS files
      Update family name of XMC1000 Series to XMC1000
    </release>
    <release version="1.5.2">
      Infineon CMSIS-Core files released 27. June 2014
      Update the value of Dfpu for Floating Point Unit (FPU) from 0 to NO_FPU 
      Update the value of Dmpu for Memory Protection Unit (MPU) from 0 to NO_MPU 
    </release>
    <release version="1.5.1">
      Infineon CMSIS-Core files released 16. June 2014
      update the SVD files
    </release>
    <release version="1.5.0">
      Infineon CMSIS-Core files released 25. April 2014
      Adjust the version number to Keil pack release
      Add the assembler preprocessor --cpreproc  
      Update the docs for XMC 2Go board
      Add compiler conditions for IAR and GCC
    </release>
    <release version="1.0.2">
      Infineon CMSIS-Core files released 28. January 2014
      Added Devices: XMC1100-Q024x0008, XMC1100-Q024x0016, XMC1100-Q024x0032, 
                     XMC1100-Q024x0064, XMC1100-Q040x0016, XMC1100-Q040x0032,
                     XMC1100-Q040x0064, XMC1100-T016x0064, XMC1201-Q040x0016,
                     XMC1201-Q040x0032, XMC1201-Q040x0064, XMC1201-Q040x0128,
                     XMC1201-Q040x0200, XMC1201-T038x0128, XMC1202-Q024x0016,
                     XMC1202-Q024x0032, XMC1202-Q040x0016, XMC1202-Q040x0032,
                     XMC1301-Q024x0008, XMC1301-Q024x0016, XMC1301-Q040x0008,
                     XMC1301-Q040x0016, XMC1301-Q040x0032, XMC1302-Q024x0016,
                     XMC1302-Q024x0032, XMC1302-Q024x0064, XMC1302-Q040x0016,
                     XMC1302-Q040x0032, XMC1302-Q040x0064, XMC1302-Q040x0128,
                     XMC1302-T016x0008, XMC1302-T016x0016, XMC1302-T016x0032,
                     XMC1302-T038x0128
    </release>                         
    <release version="1.0.1">
      Infineon CMSIS-Core files released 19. July 2013
      Added Devices: XMC1302-8
    </release>
    <release version="1.0.0">
      First Release version of XMC1000 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Infineon</keyword>
    <keyword>XMC1000</keyword>
  </keywords>

    
  <devices>

    <!-- generated, do not modify this section! -->

    <family Dfamily="XMC1000" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>
      <book    name="Documents\DDI0432C_cortex_m0_r0p0_trm.pdf"       title="Cortex-M0 Technical Reference Manual"/>
      <book    name="Documents\dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>

      <description>
        The XMC1000 series is designed for low cost 8/16-bit microcontroller applications, offering 
        performance, low power, simple instruction set and memory addressing together with reduced code 
        size compared to existing 8/16-bit architectures.

        - Ultra low power consumption
        - Nested Vectored Interrupt Controller (NVIC)
        - Event Request Unit (ERU) for programmable processing of ext./int. service requests
        - MATH Co-processor (MATH), consists of a CORDIC unit and a division unit
        - CAN communication 
        - LED and Touch Sense Control Unit
      </description>
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <environment name="uv">
        <AMisc>--cpreproc</AMisc>
      </environment>


      <feature type="RTC"           n="32768"/>
      <feature type="WDT"           n="1"/>
      <feature type="Temp"          n="-40"     m="85"              name="Devices with order code F"/>
      <feature type="Temp"          n="-40"     m="105"             name="Devices with order code X"/>

      <!-- ******************************  subFamily XMC1100  ****************************** -->
      <subFamily DsubFamily="XMC1100 Series">
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ComOther"      n="2"                         name="Universal Serial Interface"/>
        
      <!-- ******************************  XMC1100-Q024x0008  ****************************** -->
      <device Dname="XMC1100-Q024x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1100_series\Include\XMC1100.h"  define="XMC1100_Q024x0008"/>
        <debug      svd="SVD\XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents\xmc1100_rm_v1.1.pdf"               title="XMC1100 Series Reference Manual"/>
        <book    name="Documents\xmc1100_ds_v1.4_2014_05.pdf"               title="XMC1100 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1100-ES-v01_07-EN.pdf"               title="XMC1100 Series Errata Sheet"/> 
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>        
      </device>

