jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
      <!-- ******************************  XMC1202-T016x0032  ****************************** -->
      <device Dname="XMC1202-T016x0032">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1200_series\Include\XMC1200.h"  define="XMC1202_T016x0032"/>
        <debug      svd="SVD\XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1200_rm_v1.1.pdf"               title="XMC1200 Series Reference Manual"/>
        <book    name="Documents\xmc1200_ds_v1.4_2014_05.pdf"               title="XMC1200 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1200-ES-v01_06-EN.pdf"               title="XMC1200 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1202-T028x0032  ****************************** -->
      <device Dname="XMC1202-T028x0032">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1200_series\Include\XMC1200.h"  define="XMC1202_T028x0032"/>
        <debug      svd="SVD\XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1200_rm_v1.1.pdf"               title="XMC1200 Series Reference Manual"/>
        <book    name="Documents\xmc1200_ds_v1.4_2014_05.pdf"               title="XMC1200 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1200-ES-v01_06-EN.pdf"               title="XMC1200 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="28"/>  
      </device>
      
      <!-- ******************************  XMC1202-T028x0064  ****************************** -->
      <device Dname="XMC1202-T028x0064">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1200_series\Include\XMC1200.h"  define="XMC1202_T028x0064"/>
        <debug      svd="SVD\XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1200_rm_v1.1.pdf"               title="XMC1200 Series Reference Manual"/>
        <book    name="Documents\xmc1200_ds_v1.4_2014_05.pdf"               title="XMC1200 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1200-ES-v01_06-EN.pdf"               title="XMC1200 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="26"/>
        <feature type="SOP"           n="28"/>  
      </device>   
      </subFamily>

      <!-- ************************  Subfamily 'XMC1300'  **************************** -->
      <subFamily DsubFamily="XMC1300 Series">
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ComOther"      n="2"                         name="Universal Serial Interface"/>
              
      <!-- ******************************  XMC1301-Q024x0008  ****************************** -->
      <device Dname="XMC1301-Q024x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_Q024x0008"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0008  ****************************** -->
      <device Dname="XMC1301-Q040x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_Q040x0008"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T016x0008  ****************************** -->
      <device Dname="XMC1301-T016x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_T016x0008"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0008  ****************************** -->
      <device Dname="XMC1301-T038x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_T038x0008"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>  
      </device>

      <!-- ******************************  XMC1301-Q024x0016  ****************************** -->
      <device Dname="XMC1301-Q024x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_Q024x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0016  ****************************** -->
      <device Dname="XMC1301-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_Q040x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T016x0016  ****************************** -->
      <device Dname="XMC1301-T016x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_T016x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0016  ****************************** -->
      <device Dname="XMC1301-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_T038x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>  
      </device>

      <!-- ******************************  XMC1301-Q040x0032  ****************************** -->
      <device Dname="XMC1301-Q040x0032">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_Q040x0032"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>  
      </device>

      <!-- ******************************  XMC1301-T038x0032  ****************************** -->
      <device Dname="XMC1301-T038x0032">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1301_T038x0032"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>  
      </device>

        
      <!-- ******************************  XMC1302-T016x0008  ****************************** -->
      <device Dname="XMC1302-T016x0008">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1302_T016x0008"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1302-Q024x0016  ****************************** -->
      <device Dname="XMC1302-Q024x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1302_Q024x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>
      </device>

      <!-- ******************************  XMC1302-Q040x0016  ****************************** -->
      <device Dname="XMC1302-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1302_Q040x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>
      </device>

      <!-- ******************************  XMC1302-T016x0016  ****************************** -->
      <device Dname="XMC1302-T016x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1302_T016x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>        
      </device>

      <!-- ******************************  XMC1302-T038x0016  ****************************** -->
      <device Dname="XMC1302-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device\XMC1300_series\Include\XMC1300.h"  define="XMC1302_T038x0016"/>
        <debug      svd="SVD\XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1300_rm_v1.1.pdf"               title="XMC1300 Series Reference Manual"/>
        <book    name="Documents\xmc1300_ds_v1.4_2014_05.pdf"               title="XMC1300 Series Data Sheet"/>
        <book    name="Documents\Infineon-XMC1300-ES-v01_06-EN.pdf"               title="XMC1300 Series Errata Sheet"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>        
      </device>

