jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
      <!-- ******************************  XMC1402-Q040x0032   ****************************** -->
      <device Dname="XMC1402-Q040x0032">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q040x0032"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="SOP"           n="40"/>
      </device> 
      
      <!-- ****************************** XMC1402-Q040x0064   ****************************** -->
      <device Dname="XMC1402-Q040x0064">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402-Q040x0064"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="QFN"           n="40"/>
      </device>      

      <!-- ******************************  XMC1402-Q040x0128  ****************************** -->
      <device Dname="XMC1402-Q040x0128">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q040x0128"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
      </device>
      
      <!-- ******************************  XMC1402-Q048x0032   ****************************** -->
      <device Dname="XMC1402-Q048x0032">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q048x0032"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
        <feature type="QFN"           n="48"/>
      </device> 
      
      <!-- ****************************** XMC1402-Q048x0064   ****************************** -->
      <device Dname="XMC1402-Q048x0064">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q048x0064"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
      </device>      

      <!-- ******************************  XMC1402-Q048x0128  ****************************** -->
      <device Dname="XMC1402-Q048x0128">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q048x0128"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
      </device>

      <!-- ****************************** XMC1402-Q064x0064   ****************************** -->
      <device Dname="XMC1402-Q064x0064">
        <processor Dclock="48000000"/>
        <compile header="Device\XMC1400_series\Include\XMC1400.h"  define="XMC1402_Q064x0064"/>
        <debug      svd="SVD\XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents\xmc1400_rm_v0.1.pdf"               title="XMC1400 Series Reference Manual"/>
        <book    name="Documents\XMC1_Peripheral_Library.chm"          title="XMC1 Peripheral Library"/>  
      </device>      

