jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
    <condition id="XMC1301_Q24">                                     
      <description>Infineon XMC1301 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q024*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>    
    
    <condition id="XMC1301_Q40">                                     
      <description>Infineon XMC1201  series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-Q040*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1301_T16">                                     
      <description>Infineon XMC1301 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T016*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>    

    <condition id="XMC1301_T38">                                     
      <description>Infineon XMC1301 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1301-T038*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="XMC1302_Q24">                                     
      <description>Infineon XMC1302 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q024*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>        

    <condition id="XMC1302_Q40">                                     
      <description>Infineon XMC1302 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-Q040*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1302_T16">                                     
      <description>Infineon XMC1302 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T016*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>    

    <condition id="XMC1302_T38">                                     
      <description>Infineon XMC1302 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1302-T038*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC13xx">                                     
      <description>Infineon XMC13xx series</description>
      <accept condition="XMC1301_Q24"/>
      <accept condition="XMC1301_Q40"/>
      <accept condition="XMC1301_T16"/>
      <accept condition="XMC1301_T38"/>
      <accept condition="XMC1302_Q24"/>
      <accept condition="XMC1302_Q40"/>
      <accept condition="XMC1302_T16"/>
      <accept condition="XMC1302_T38"/>
    </condition> 
    
    <condition id="XMC1401_Q48">                                     
      <description>Infineon XMC1401 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1401-Q048*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1401_F64">                                     
      <description>Infineon XMC1401 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1401-F064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1402_Q40">                                     
      <description>Infineon XMC1402 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q040*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1402_Q48">                                     
      <description>Infineon XMC1402 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q048*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1402_Q64">                                     
      <description>Infineon XMC1402 series VFQN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-Q064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1402_F64">                                     
      <description>Infineon XMC1402 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1402-F064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1403_Q48">                                     
      <description>Infineon XMC1403 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1403-Q048*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1403_Q64">                                     
      <description>Infineon XMC1402 series VQFN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1403-Q064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1404_Q48">                                     
      <description>Infineon XMC1404 series VQFN48</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-Q048*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1404_Q64">                                     
      <description>Infineon XMC1404 series VQFN64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-Q064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1404_F64">                                     
      <description>Infineon XMC1404 series LQFP64</description>   
      <require Dvendor="Infineon:7" Dname="XMC1404-F064*"/>      
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC1401">                                     
      <description>Infineon XMC1401 LEDTS series</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
    </condition> 

    <condition id="XMC1402">                                     
      <description>Infineon XMC1402 Control series</description>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
    </condition> 

    <condition id="XMC1403">                                     
      <description>Infineon XMC1403 CAN series</description>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
    </condition> 

