jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
    <condition id="XMC1404">                                     
      <description>Infineon XMC1404 CAN Control series</description>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
    </condition> 
    
    <condition id="XMC14xx">                                     
      <description>Infineon XMC14xx series</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
    </condition> 
    
    <condition id="XMC1">                                     
      <description>Infineon XMC1000 family</description>
      <accept  condition="XMC11xx"/>
      <accept  condition="XMC12xx"/>      
      <accept  condition="XMC13xx"/>  
      <accept  condition="XMC14xx"/>   
    </condition>    
    
    <condition id="XMC1 CMSIS">                                     
      <description>Infineon XMC1000 device series</description>
      <require condition="XMC1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>		  
    </condition>
    
    <condition id="XMC1 CMSIS SCU">
      <description>Infineon XMC1000 device series and CMSIS-CORE</description> 
      <require condition="XMC1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/> 
      <require Cclass="Device" Cgroup="Startup"/>  	  
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
    </condition>

    <condition id="XMC1 CMSIS Driver I2C">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver I2C</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2C"/>
    </condition>    
    
    <condition id="XMC1 CMSIS Driver SPI">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver SPI</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
    </condition>    

    <condition id="XMC1 CMSIS Driver USART">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver USART</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="UART"/>
    </condition>    
        
</conditions>

  
  <examples>
      <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC_2Go\Blinky">
      <description>UART based Blinky example</description>
      <board name="XMC 2Go" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC1100 Boot Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards\Infineon\XMC1100 Boot Kit\CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards\Infineon\XMC1100 Boot Kit\CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC1200 Boot Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards\Infineon\XMC1200 Boot Kit\CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards\Infineon\XMC1200 Boot Kit\CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
