jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC1300 Boot Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards\Infineon\XMC1300 Boot Kit\CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards\Infineon\XMC1300 Boot Kit\CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky example" doc="Abstract.txt" folder="Boards\Infineon\XMC1400 Boot Kit\Blinky">
      <description>Blink LEDs in board</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC1400_EasyStart.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
  
    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards\Infineon\XMC1400 Boot Kit\CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards\Infineon\XMC1400 Boot Kit\CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
  
     <!-- Infineon XMC1 Low Level Driver (LLD) Examples -->
    <!-- ANACMP -->    
    <example name="ANACMP" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\ANACMP\ACMP_CMP">
      <description>ANACMP example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="ANACMP" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\ANACMP\ACMP_CMP">
      <description>ANACMP example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- BCCU -->    
    <example name="BCCU" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\BCCU\BCCU_LED">
      <description>BCCU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\bccu_led.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="BCCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CCU4 -->    
    <example name="CCU4" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\CCU4\CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="CCU4" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\CCU4\CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <example name="CCU4" doc="Readme.txt" folder="Device\XMClib\examples\XMC1400_series\CCU4\CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CAN -->    
    <example name="CAN" doc="Readme.txt" folder="Device\XMClib\examples\XMC1400_series\CAN\CAN_LOOPBACK_EXT_OSC">
      <description>CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\can_loopback_ext_osc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU8 -->    
    <example name="CCU8" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\CCU8\CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <example name="CCU8" doc="Readme.txt" folder="Device\XMClib\examples\XMC1400_series\CCU8\CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- ERU -->    
    <example name="ERU" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\ERU\ERU_EXTINT">
      <description>ERU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <example name="ERU" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\ERU\ERU_EXTINT">
      <description>ERU example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- FLASH -->    
    <example name="FLASH" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\FLASH\FLASH_PROGRAM">
      <description>FLASH example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\flash_program.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- GPIO -->    
    <example name="GPIO" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\GPIO\GPIO_TOGGLE">
      <description>GPIO example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="GPIO" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\GPIO\GPIO_TOGGLE">
      <description>GPIO example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- LEDTS Example1 -->    
    <example name="LEDTS Example1" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\LEDTS\XMC12_7_Segment_Display_Example1">
      <description>LEDTS Example1</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ledts_example1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- LEDTS Example2 -->    
    <example name="LEDTS Example2" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\LEDTS\XMC12_7_Segment_Display_Example2">
      <description>LEDTS Example2</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ledts_example2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- RTC -->    
    <example name="RTC" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\RTC\RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   
    <example name="RTC" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\RTC\RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>                         
    <!-- SPI -->    
    <example name="SPI" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\SPI\SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="SPI" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\SPI\SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    
    <!-- UART -->    
    <example name="UART" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\UART\UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    
    <example name="UART" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\UART\UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- VADC -->  
    <example name="VADC" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\VADC\VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      
    <example name="VADC" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\VADC\VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- WDT -->  
    <example name="WDT" doc="Readme.txt" folder="Device\XMClib\examples\XMC1200_series\WDT\WDT_FEED">
      <description>WDT example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      
    <example name="WDT" doc="Readme.txt" folder="Device\XMClib\examples\XMC1300_series\WDT\WDT_FEED">
      <description>WDT example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
                              
