jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="XMC1 CMSIS">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon XMC1000 device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\XMC1100_series\Include\"  condition="XMC11xx"/>
        <file category="include" name="Device\XMC1200_series\Include\"  condition="XMC12xx"/>
        <file category="include" name="Device\XMC1300_series\Include\"  condition="XMC13xx"/>
        <file category="include" name="Device\XMC1400_series\Include\"  condition="XMC14xx"/>
        
       <!-- startup files -->
        <file category="source" name="Device\XMC1100_series\Source\ARM\startup_XMC1100.s" attr="config"      condition="XMC11xx" version="1.4"/>
        <file category="source" name="Device\XMC1200_series\Source\ARM\startup_XMC1200.s" attr="config"      condition="XMC12xx" version="1.4"/>
        <file category="source" name="Device\XMC1300_series\Source\ARM\startup_XMC1300.s" attr="config"      condition="XMC13xx" version="1.4"/>  
        <file category="source" name="Device\XMC1400_series\Source\ARM\startup_XMC1400.s" attr="config"      condition="XMC14xx" version="1.0"/> 
        
        <!-- system file -->      
        <file category="source" name="Device\XMC1100_series\Source\system_XMC1100.c"      attr="config"      condition="XMC11xx" version="1.8"/>
        <file category="source" name="Device\XMC1200_series\Source\system_XMC1200.c"      attr="config"      condition="XMC12xx" version="1.8"/>
        <file category="source" name="Device\XMC1300_series\Source\system_XMC1300.c"      attr="config"      condition="XMC13xx" version="1.8"/>
        <file category="source" name="Device\XMC1400_series\Source\system_XMC1400.c"      attr="config"      condition="XMC14xx" version="1.0"/>
        
      </files>
    </component>

    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.0.1" condition="XMC1 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver\"/>      
        <file category="header"  name="RTE_Driver\Config\XMC1100_T16\RTE_Device.h" condition="XMC1100_T16" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1100_Q24\RTE_Device.h" condition="XMC1100_Q24" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver\Config\XMC1100_T38\RTE_Device.h" condition="XMC1100_T38" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1100_Q40\RTE_Device.h" condition="XMC1100_Q40" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver\Config\XMC1200_T38\RTE_Device.h" condition="XMC1200_T38" attr="config" version="1.0.0"/>      
        <file category="header"  name="RTE_Driver\Config\XMC1200_T38\RTE_Device.h" condition="XMC1201_T38" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver\Config\XMC1200_Q40\RTE_Device.h" condition="XMC1201_Q40" attr="config" version="1.0.0"/>      
        <file category="header"  name="RTE_Driver\Config\XMC1200_T16\RTE_Device.h" condition="XMC1202_T16" attr="config" version="1.0.0"/>    
        <file category="header"  name="RTE_Driver\Config\XMC1200_Q24\RTE_Device.h" condition="XMC1202_Q24" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver\Config\XMC1200_T28\RTE_Device.h" condition="XMC1202_T28" attr="config" version="1.0.0"/>    
        <file category="header"  name="RTE_Driver\Config\XMC1200_Q40\RTE_Device.h" condition="XMC1202_Q40" attr="config" version="1.0.0"/>          
        <file category="header"  name="RTE_Driver\Config\XMC1300_T16\RTE_Device.h" condition="XMC1302_T16" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1300_Q24\RTE_Device.h" condition="XMC1302_Q24" attr="config" version="1.0.0"/>     
        <file category="header"  name="RTE_Driver\Config\XMC1300_T38\RTE_Device.h" condition="XMC1302_T38" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1300_Q40\RTE_Device.h" condition="XMC1302_Q40" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver\Config\XMC1300_T16\RTE_Device.h" condition="XMC1301_T16" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1300_Q24\RTE_Device.h" condition="XMC1301_Q24" attr="config" version="1.0.0"/>     
        <file category="header"  name="RTE_Driver\Config\XMC1300_T38\RTE_Device.h" condition="XMC1301_T38" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1300_Q40\RTE_Device.h" condition="XMC1301_Q40" attr="config" version="1.0.0"/>          
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q48\RTE_Device.h" condition="XMC1401_Q48" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_F64\RTE_Device.h" condition="XMC1401_F64" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q40\RTE_Device.h" condition="XMC1402_Q40" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q48\RTE_Device.h" condition="XMC1402_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q64\RTE_Device.h" condition="XMC1402_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_F64\RTE_Device.h" condition="XMC1402_F64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q48\RTE_Device.h" condition="XMC1403_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q64\RTE_Device.h" condition="XMC1403_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q48\RTE_Device.h" condition="XMC1404_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver\Config\XMC1400_Q64\RTE_Device.h" condition="XMC1404_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver\Config\XMC1400_F64\RTE_Device.h" condition="XMC1404_F64" attr="config" version="1.0.0"/>  
        </files>
    </component>
        
    <!-- START: Infineon Standard Peripherals Low Level Drivers -->
   
    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Analog-to-digital converter (ADC) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___v_a_d_c.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />      
        <file category="source" name="Device\XMClib\src\xmc_vadc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="ACMP" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Analog Comparator (ACMP) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___a_c_m_p.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />        
        <file category="source" name="Device\XMClib\src\xmc_acmp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="BCCU" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Brightness and Colour Control Unit (BCCU) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___b_c_c_u.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />  
        <file category="source" name="Device\XMClib\src\xmc_bccu.c"/>
      </files>
    </component>

