jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="XMClib" Csub="CAN" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>CAN Communication (CAN) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___c_a_n.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />        
        <file category="source" name="Device\XMClib\src\xmc_can.c"/>
      </files>
    </component>  
    
    <component Cclass="Device" Cgroup="XMClib" Csub="CCU4" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Capture Compare Unit 4 (CCU4) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___c_c_u4.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />        
        <file category="source" name="Device\XMClib\src\xmc_ccu4.c"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="XMClib" Csub="CCU8" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Capture Compare Unit 8 (CCU8) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___c_c_u8.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />  
        <file category="source" name="Device\XMClib\src\xmc_ccu8.c"/>
      </files>
    </component>   

    <component Cclass="Device" Cgroup="XMClib" Csub="ERU" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Event Request Unit (ERU) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___e_r_u.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_eru.c"/>
        <file category="source" name="Device\XMClib\src\xmc1_eru.c"/>
      </files>
    </component> 
    
    <component Cclass="Device" Cgroup="XMClib" Csub="GPIO" Cversion="2.1.2" condition="XMC1 CMSIS">
      <description>General Purpose Input/Output (GPIO) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___g_p_i_o.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_gpio.c"/>
        <file category="source" name="Device\XMClib\src\xmc1_gpio.c"/>
      </files>
    </component> 
            
    <component Cclass="Device" Cgroup="XMClib" Csub="I2C" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Inter Integrated Circuit (also known as I2C) (I2C) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___i2_c.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>
        <file category="source" name="Device\XMClib\src\xmc_i2c.c"/>      
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="I2S" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Inter-IC Sound Interface (also known as I2S) (I2S) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___i2_s.html"/>      
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>
        <file category="source" name="Device\XMClib\src\xmc_i2s.c"/>      
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>LED and Touch Sense Control Unit (LEDTS) driver for XMC1x00</description>
      <files>     
        <file category="doc"    name="Device\XMClib\doc\html\group___l_e_d_t_s.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_ledts.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="MATH" Cversion="2.1.2" condition="XMC1 CMSIS">
      <description>Math Library of Cordic Coprocessor for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___m_a_t_h.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_math.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="PAU" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Peripheral Access Unit for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___p_a_u.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_pau.c"/>
      </files>
    </component>
         
    <component Cclass="Device" Cgroup="XMClib" Csub="POSIF" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Position Interface (POSIF) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___p_o_s_i_f.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_posif.c"/>       
      </files>
    </component>
    
