jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC1000_DFP.2.2.0.pdsc
     <component Cclass="Device" Cgroup="XMClib" Csub="PRNG" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Pseudo Random Number Generator for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___p_r_n_g.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_prng.c"/>
      </files>
    </component>   
        
    <component Cclass="Device" Cgroup="XMClib" Csub="RTC" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Real Time Clock (RTC) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___r_t_c.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc_rtc.c"/>
        <file category="source" name="Device\XMClib\src\xmc1_rtc.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SCU" Cversion="2.1.2" condition="XMC1 CMSIS">
      <description>System Control Unit (SCU) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___s_c_u.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />
        <file category="source" name="Device\XMClib\src\xmc1_scu.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SPI" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Serial Peripheral Interface (SPI) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___s_p_i.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />      
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>    
        <file category="source" name="Device\XMClib\src\xmc_spi.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="UART" Cversion="2.1.2" condition="XMC1 CMSIS SCU">
      <description>Universal Asynchronous Receiver Transmitter (UART) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___u_a_r_t.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />  
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>    
        <file category="source" name="Device\XMClib\src\xmc_uart.c"/>
      </files>
    </component>  
    
    <component Cclass="Device" Cgroup="XMClib" Csub="WDT" Cversion="2.1.2" condition="XMC1 CMSIS">
      <description> Watchdog Timer (WDT) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___w_d_t.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />  
        <file category="source" name="Device\XMClib\src\xmc_wdt.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="FLASH" Cversion="2.1.2" condition="XMC1 CMSIS">
      <description> Flash Driver (FLASH) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___f_l_a_s_h.html"/> 
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source"  name="Device\XMClib\src\xmc_common.c" />  
        <file category="source" name="Device\XMClib\src\xmc1_flash.c"/>
      </files>
    </component>


    <!-- END: Infineon Standard Peripherals Low Level Drivers -->    

    <!-- START: CMSIS Peripherals Drivers -->
 
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" Cversion="2.03" condition="XMC1 CMSIS Driver I2C">
      <description>I2C Driver for XMC1000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C                
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01" Cversion="2.05" condition="XMC1 CMSIS Driver SPI">
      <description>SPI Driver for XMC1000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SPI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" Cversion="2.05" condition="XMC1 CMSIS Driver USART">
      <description>USART Driver for XMC1000 Family</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART              
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART.c"/>
      </files>
    </component>
    
    <!-- END: CMSIS Peripherals Drivers -->

    
  </components>
</package>
